{
  "api.doc.v3.http-headers.title": "Configuração de cabeçalhos HTTP",
  "api.doc.v3.http-headers.description": "<p>As requisições para a API devem possuir os 3 HTTP HEADERS abaixo:</p>\n<ol>\n    <li><strong>Authorization:</strong> Contém as informações de autenticação do usuário.</li>\n    <li><strong>X-AGILE-CLIENT:</strong> Sempre será \"EXTERNAL_APP\".</li>\n    <li><strong>Accept-Version:</strong> Versão do endpoint requisitado.</li>\n</ol>\n<p>Na v3 temos o Header de versão do cabeçalho. Ele serve para identificar qual a versão do endpoint que está sendo requisitada. Mais detalhes sobre a versão dos endpoints na seção de <strong>Versionamento por cabeçalho</strong> desta documentação.</p>\n<p>Não é necessário adicionar o HTTP Header Accept-Version em URLs relacionadas à v1 e v2 da API.</p>\n<h3>O que é X-AGILE-CLIENT?</h3>\n<p>É o cabeçalho utilizado para identificar a origem da requisição. O valor “EXTERNAL_APP” indica que a requisição é feita por clientes externos.</p>\n<h3>Versionamento por cabeçalho</h3>\n<p>A partir da APIv3 você pode implementar uma integração e indicar qual versão do endpoint quer utilizar. Isso garante que, caso seja feita uma alteração não retrocompatível no endpoint, sua integração continue funcionando normalmente.</p>\n<p>A última versão da APIv3 sempre será representada por uma data. Por exemplo, vamos supor que a última versão seja 2019-08-28. Esta versão quer dizer que a última alteração não retrocompatível feita na APIv3 foi lançada na data 28/08/2019. Ou seja, quando esta versão for usada no cabeçalho da requisição, você estará requisitando num endpoint que foi criado/alterado a partir desta data, para trás. Como as próximas atualizações não retrocompatíveis serão lançadas com versões de cabeçalhos correspondentes a datas futuras, você não precisa se preocupar, pois sua integração não ficará comprometida por tais atualizações.</p>\n<p>Caso seja necessário atualizar algum ponto da integração para uma nova versão, pode ser alterado o cabeçalho de apenas uma chamada à API, não sendo necessário atualizar o restante da integração com o Involves Stage.</p>",
  "api.doc.v3.http-headers.current-version.description": "Versão atual da APIv3",
  "api.doc.v3.http-headers.version-fetch-failed.description": "Erro ao buscar versão atual"
}