{
  "api.doc.v3.http-methods.title": "Métodos HTTP",
  "api.doc.v3.http-methods.description": "<p>A API do Involves Stage utiliza algum dos métodos HTTP apropriados para cada tipo de requisição. A tabela abaixo descreve os métodos utilizados:</p>\n\n<table>\n    <thead>\n        <th>Método</th>\n        <th>Descrição</th>\n    </thead>\n    <tbody>\n        <tr>\n            <td>GET</td>\n            <td>Utilizado para retornar recursos do Involves Stage</td>\n        </tr>\n        <tr>\n            <td>POST</td>\n            <td>Utilizado para criar recursos ou executar ações sobre esses recursos</td>\n        </tr>\n        <tr>\n            <td>PUT</td>\n            <td>Utilizado para modificar recursos</td>\n        </tr>\n        <tr>\n            <td>PATCH</td>\n            <td>Utilizado para alterar propriedades específicas de um recurso</td>\n        </tr>\n        <tr>\n            <td>DELETE</td>\n            <td>Utilizado para remover recursos</td>\n        </tr>\n    </tbody>\n</table>\n\n<h3>Respostas HTTP</h3>\n\n<p>Em geral, todos os demais serviços da API retornam um Status HTTP e, opcionalmente, um objeto JSON (Javascript Object Notation). Os objetos JSON são definidos a nível de serviço e serão detalhados na documentação de cada endpoint individualmente. Já os Status HTTP de retorno são padronizados da seguinte forma:</p>\n\n<table>\n    <thead>\n        <th>Status</th>\n        <th>Significado HTTP</th>\n        <th>Detalhes</th>\n    </thead>\n    <tbody>\n        <tr>\n            <td>200</td>\n            <td>OK</td>\n            <td>A requisição à API foi processada com sucesso.</td>\n        </tr>\n        <tr>\n            <td>400</td>\n            <td>Bad Request</td>\n            <td>A requisição está inconsistente. O problema pode ser causado por parâmetros não enviados ou mal formatados. A mensagem de erro de retorno pode auxiliar a descobrir onde está o problema.</td>\n        </tr>\n        <tr>\n            <td>401</td>\n            <td>Unauthorized</td>\n            <td>O header de autenticação da requisição não foi enviado ou está inválido.</td>\n        </tr>\n        <tr>\n            <td>403</td>\n            <td>Forbidden</td>\n            <td>O usuário autenticado não tem permissão para executar a ação requisitada.</td>\n        </tr>\n        <tr>\n            <td>404</td>\n            <td>Not Found</td>\n            <td>O endereço da requisição não existe ou o recurso solicitado não se encontra no servidor.</td>\n        </tr>\n        <tr>\n            <td>406</td>\n            <td>Not Acceptable</td>\n            <td>A requisição foi enviada com cabeçalhos inválidos, como o header Accept-Version, enviado com uma versão não suportada.</td>\n        </tr>\n        <tr>\n            <td>412</td>\n            <td>Precondition Failed</td>\n            <td>Alguma pré condição de requisição, como o header X-AGILE-CLIENT, não foi enviada corretamente.</td>\n        </tr>\n        <tr>\n            <td>500</td>\n            <td>Internal Server Error</td>\n            <td>A requisição causou um erro inesperado no servidor. Pode indicar uma inconformidade do sistema e deve ser informado a equipe de suporte.</td>\n        </tr>\n    </tbody>\n</table>"
}